'''print("        เลือกเมนูเพื่อทำรายการ")
print("*************************************")
print("        กด 1 เลือกเหมาจ่าย")
print("        กด 2 เลือกจ่ายเพิ่ม")
print("*************************************")
x=int(input("กด 1 หรือ 2 \nกด"))
if x==1 :
    a=int(input("กรุณากรอกระยะทาง km ="))
    if a<=25 :
        print("ค่าใช้จ่ายรวม 25 บาท")
    else :
        print("ค่าใช้จ่ายรวม 55 บาท")
if x==2 :
    b=int(input("ระยะทาง km ="))
    if b<25:
        print("ค่าใช้จ่ายรวม 25 บาท",int)
    else:
        print("ค่าใช้จ่ายรวม 80 บาท")'''

'''print("กรุณากรอกจำนวนครั้งการรับค่า")
a=int(input("จำนวนครั้ง : "))
i=1
sum=0
while(i<=a):
    b=int(input("กรอกตัวเลข : "))
    i+=1
    sum=sum+b
print("ผลรวมของค่าทั้งหมด = ",sum)'''

'''print("ป้อนชื่ออาหารสุดโปรดของคุณ หรือ exit เพื่อออกจากโปรแกรม")
i=1
x=0
y=0
food=[]
while(i>0) :
    a=str(input("อาหารโปรดอันดับที่ "+str(i)+" คือ "))
    if a== 'exit':
        break
    i+=1
    food.append(a)
print("++++++++++++++++++++++++++++++++++++++++++")
print("อาหารสุดโปรดของคุณมีดังนี้",end="\t")
for x in food :
    y+=1
    print(y,'.',x,end="\t")'''

'''a=[]
while True :
    b = input('---ร้านเจ๋งเป้ง---\n เพิ่ม [a]\n เเสดง [s]\n ออกจากระบบ [x]\n')
    b = b.lower()
    if b=='a':
        c = input('ป้อนรายการลูกค้า(รหัส:ชื่อ:จังหวัด)')
        a.append(c)
        print('\n*********ข้อมูลได้เข้าสู่ระบบเเล้ว*********\n')
    elif b=='s':
        print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        print('{0:-<8}{0:-<10}{2:10}'.format('รหัส','ชื่อ','จังหวัด'))
        print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        for d in a:
            e = d.split(":")
            print('{0[0]:<6} {0[1]:<10}({0[2]:<10})'.format(e))
            continue
    elif b=='x':
        break
print('ทำคำสั่งถัดไป')'''